{
  "header": {
    "job": "software engineer",
    "change-lang": "Click a flag to change the language"
  },
  "right-part": {
    "profile": {
      "title": "profile",
      "content": "A fourth-year computer engineering student in a work-study program, I am seeking new challenges. With two years of experience as a Fullstack Developer, I have refined my front-end and back-end development skills. I am deeply committed to delivering high-quality solutions on time. My experience across various projects, programming languages, and frameworks has enabled me to become versatile and contribute effectively to the success of a dynamic team."
    },
    "experience": {
      "title": "experience",
      "tasks": {
        "nsysu": {
          "content": "National Sun Yat-Sen University (NSYSU) - Taiwan",
          "dates-job-title": "June 2024 - September 2024: Research Assistant",
          "1": "Assistance in medical imaging analysis using machine learning"
        },
        "work-study-program": {
          "content": "Sis ID",
          "dates-job-title": "September 2024 - Present: Full-stack Developer",
          "1": "Experienced developer mastering frontend and backend technologies (API and web application) using Java Spring, Angular, MongoDB, and PostgreSQL.",
          "2": "Developed a graphical interface for verifying bank account details via the CoP system using an existing technical connector.",
          "3": "Worked on a collaborative SaaS solution to combat financial fraud.",
          "4": "Worked with microservice architectures orchestrated via Kubernetes.",
          "5": "Implemented agile methodologies such as Scrum and Kanban.",
          "6": "Strong problem-solving skills and a great attention to detail in code development.",
          "7": "Played a key role in optimizing application performance, enhancing user experience, and adding various features."
        },
        "internship": {
          "content": "Sis ID",
          "dates-job-title": "2022 - Internship Developer",
          "1": "Maintained the operational status of the application, integrated new features, and updated the design system.",
          "2": "Improved and fixed unit tests, integration tests, and end-to-end tests using Cypress to enhance code quality and application robustness.",
          "3": "Contributed to migrating the application to a major Angular version."
        }
      }
    },
    "education": {
      "title": "education",
      "tasks": {
        "cpe": {
          "content": "CPE Lyon",
          "dates-job-title": "2022 - 2025: Engineering Degree in Computer Science and Communication Networks (IRC)",
          "1": "Majors: Object-oriented programming, information systems architecture, dynamic web applications",
          "2": "Minors: Accounting, economics, project management, mathematics, English"
        },
        "dut": {
          "content": "Université Claude Bernard Lyon 1",
          "dates-job-title": "2020 - 2022: DUT in Computer Science",
          "main-content": "Two-year university degree in general computer science, covering data structures, operating systems, Git, several programming languages, UML, Merise, and more."
        }
      }
    }
  },
  "left-part": {
    "contact": {
      "title": "contact"
    },
    "skills": {
      "title": "skills",
      "content.1": "Programming languages and frameworks among those I master",
      "content.2": "Development, project management using agile methods, devOps tools"
    },
    "other-skills": {
      "title": "other skills"
    },
    "languages": {
      "title": "languages"
    }
  },
  "404": {
    "button.back": "Back to home",
    "gif": {
      "alt": "A man (Vincent Vega, a character from the film Pulp Fiction by Quentin Tarantino played by John Travolta) is standing in a room, wondering where he is."
    },
    "main": "Oops! This page doesn’t exist."
  }
}
